{
  "total": [
    {
      "chapter": 1,
      "words": [
        {
          "word": "I can't thank you enough for the kindness you have shown to my family.",
          "mean": "저희 가족들에게 보여주신 친절에 뭐라 감사의 말씀을 드려야 할지 모르겠어요."
        },
        {
          "word": "I can't thank you enough for the great fun and memories.",
          "mean": "너무 즐겁고 좋은 추억이 돼서 얼마나 고마운지 모르겠어요."
        },
        {
          "word": "I can't thank you enough for offering me part-time work.",
          "mean": "아르바이트 자리를 제공해 주셔서 얼마나 고마운지 모르겠어요."
        },
        {
          "word": "I can't thank you enough for picking up my son from school today.",
          "mean": "오늘 학교에 제 아들을 데리러 가주셔서 뭐라 감사의 말씀을 드려야 할지 모르겠어요."
        },
        {
          "word": "I can't thank you enough for lending me money for this month's rent.",
          "mean": "이번 달 월세를 낼 수 있게 돈을 빌려주셔서 얼마나 고마운지 모르겠어요."
        },
        {
          "word": "I can't thank you enough for letting me stay at your house this weekend.",
          "mean": "이번 주말에 당신 집에서 머물 수 있게 해주셔서 얼마나 고마운지 몰라요."
        },
        {
          "word": "I can't thank you enough for helping me prepare the Christmas dinner.",
          "mean": "크리스마스 저녁식사 준비를 도와주셔서 얼마나 고마운지 모르겠어요."
        },
        {
          "word": "I can't thank you enough for getting me front-row tickets.",
          "mean": "앞쪽 좌석표들을 구해주셔서 뭐라 감사의 말씀을 드려야 할지 모르겠어요."
        },
        {
          "word": "I can't thank you enough for proofreading my essay.",
          "mean": "제 에세이를 교정봐주셔서 얼마나 고마운지 모르겠어요."
        },
        {
          "word": "I can't thank you enough for all that you have done for me.",
          "mean": "저를 위해 해주신 모든 것에 대해 뭐라 감사의 말씀을 드려야 할지 모르겠어요."
        }
      ]
    },
    {
      "chapter": 2,
      "words": [
        {
          "word": "Thanks to my boss, I get to take some time off next week.",
          "mean": "사장님 덕분에 다음 주에 휴가를 낼 수 있게 됐어요."
        },
        {
          "word": "Thanks to Michelle, I had to stay at work until late to finish up the project she didn't complete.",
          "mean": "미셸이 프로젝트를 완성하지 않은 탓에 그 일을 마무리 하느라 야근해야 했어요."
        },
        {
          "word": "Thanks to my mother, I'll be able to go back to work after taking three months of maternity leave.",
          "mean": "어머니 덕분에 3개월 출산휴가 기간이 끝나면 복직할 수 있게 됐어요."
        },
        {
          "word": "Thanks to John, I was able to get tickets to the baseball game this weekend.",
          "mean": "존 덕분에 이번 주말 야구 경기 티켓들을 구할 수 있게 됐어요."
        },
        {
          "word": "Thanks to the baby next door, I hardly slept a wink last night.",
          "mean": "옆집 아기 때문에 어젯밤에 거의 한숨도 못 잤어요."
        },
        {
          "word": "Thanks to my financial planner, I am now debt-free.",
          "mean": "자산 관리사 덕분에 이제 빚에서 해방됐어요."
        },
        {
          "word": "Thanks to my wedding planner, I'm almost done with all the preparations.",
          "mean": "웨딩 플래너 덕분에 모든 준비를 거의 다 마쳤어요."
        },
        {
          "word": "Thanks to express shipping, I'll be receiving my new tennis racket tonight.",
          "mean": "빠른 배송 덕분에 난 오늘 밤에 새 테니스 라켓을 받게 될 거예요."
        },
        {
          "word": "Thanks to Noah, I now have free internet access in my hotel room.",
          "mean": "노아 덕분에 이제 난 호텔방에서 무료로 인터넷에 접속할 수 있어요."
        },
        {
          "word": "Thanks to my client, I won't get any time off this summer.",
          "mean": "고객 때문에 이번 여름에는 휴가를 전혀 못 쓰겠네요."
        }
      ]
    }
  ]
}
